In [1]:
#unlike numpy, pandas can have multiple data type (but the data type should be same in 2 dimension)
import pandas as pd
two_dimension_list = [['Connie', '25', 'Mapo'],['Irene', '25', 'Shinchon'], ['Juliette','22', 'Paris'],['Ole', '29', 'Berlin']]
friend_df = pd.DataFrame(two_dimension_list)
print(type(friend_df))
friend_df

<class 'pandas.core.frame.DataFrame'>

          0   1         2
0    Connie  25      Mapo
1     Irene  25  Shinchon
2  Juliette  22     Paris
3       Ole  29    Berlin

In [2]:
#column naming(pd.DataFrame(lists, columns=list, index=list))
friend_df = pd.DataFrame(two_dimension_list, columns =['Name', 'Age', 'City'], index = [1,2,3,4])
print(friend_df.columns)
print(friend_df.index)
friend_df

Index(['Name', 'Age', 'City'], dtype='object')
Int64Index([1, 2, 3, 4], dtype='int64')

       Name Age      City
1    Connie  25      Mapo
2     Irene  25  Shinchon
3  Juliette  22     Paris
4       Ole  29    Berlin